app/Controllers/LoginController.php

SELECT *
FROM `user`
WHERE `num` = '0711223344'
 LIMIT 1
---
    public function login()
    {
        $num = $this->request->getPost('num');

        $userModel = new UserModel();
        $utilisateur = $userModel->where('num', $num)->first();