app/Models/MouvementModel.php

    public function getSoldeClient(int $userId): int
    {
        $db = \Config\Database::connect();

        // 1. Somme des Dépôts
        $depots = $db->table('mouvement')
                     ->selectSum('montant')
                     ->where('id_client', $userId)
                     ->where('type', 'depot')
                     ->get()->getRow()->montant ?? 0;

        // 2. Somme des Retraits
        $retraits = $db->table('mouvement')
                      ->selectSum('montant')
                      ->where('id_client', $userId)
                      ->where('type', 'retrait')
                      ->get()->getRow()->montant ?? 0;

        // 3. Somme des Transferts Reçus
        $transfertsRecus = $db->table('transfert')
                              ->selectSum('montant')
                              ->where('id_client_dest', $userId)
                              ->get()->getRow()->montant ?? 0;

        // 4. Somme des Transferts Envoyés
        $transfertsEnvoyes = $db->table('transfert')
                               ->selectSum('montant')
                               ->where('id_client', $userId)
                               ->get()->getRow()->montant ?? 0;
---
SELECT SUM(`montant`) AS `montant`
FROM `mouvement`
WHERE `id_client` = 3
AND `type` = 'depot'
SELECT SUM(`montant`) AS `montant`
FROM `mouvement`
WHERE `id_client` = 3
AND `type` = 'retrait'
SELECT SUM(`montant`) AS `montant`
FROM `transfert`
WHERE `id_client_dest` = 3
SELECT SUM(`montant`) AS `montant`
FROM `transfert`
WHERE `id_client` = 3